# sudo apt install git - установка системы контроля версий.

# git - система контроля версий - программа для управления версиями кода.

# github - сервис для хранения кода.

# Репозиторий - папки для работы с github. Он может с ней взаимодействовать.

# git init - превращает текущую директорию в git репозиторий.

# git status - проверка статуса репозитория.
# git add <file_name> / git add . - добавить файлы к отслеживанию изменений.
# git commit -m "комментарий к версии" - сохранения версии кода / сохдание коммита.
# git remote add <название-переменной> (принято называть "origin") <ссылка-на-удалённый-репозиторий> - соединение локального репозитория с удалённым.
# git push <название-переменной> <название-ветки> - отправка версии на github